[
    {
        "id": "l6z5guh",
        "author": "tuskdust",
        "created_utc": 1717451630.0,
        "score": 2,
        "parent_id": "t1_l6yx3mn",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z5guh/",
        "text": "Couldn’t imagine it ever happening, the quality of writing that ChatGPT churns out is absolute shit. It’s hilarious having these arguments every few years when the latest tech craze is building up. Social media, 360 videos, VR, AR, crypto, NFTs, I’ve been right being skeptical every time so far. And with each instance it’s the same overly emotional guys yelling at me that my head is in the sand or whatever."
    },
    {
        "id": "l6ys49t",
        "author": "UrOpinionIsTrashFR",
        "created_utc": 1717447004.0,
        "score": 6,
        "parent_id": "t1_l6yql6r",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ys49t/",
        "text": "lmao"
    },
    {
        "id": "l6zwj8o",
        "author": "5chrodingers_pussy",
        "created_utc": 1717462234.0,
        "score": 4,
        "parent_id": "t1_l6yql6r",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zwj8o/",
        "text": "Whole lot of nothingburger comment here. OP is sensibly close to true. \n\nGotta put that brain to work if you want to look like anything more than a tourist playing a smartass"
    },
    {
        "id": "l6yvye2",
        "author": "tuskdust",
        "created_utc": 1717448277.0,
        "score": 0,
        "parent_id": "t1_l6yql6r",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yvye2/",
        "text": "Explain yourself."
    },
    {
        "id": "l6z4grx",
        "author": "tuskdust",
        "created_utc": 1717451273.0,
        "score": 7,
        "parent_id": "t1_l6z2yed",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z4grx/",
        "text": "I mean that calling it “intelligent” is a dupe. It’s not intelligent. And the comparison to NFTs was about the over-promising of AI capabilities to drive investment. Not that complicated."
    },
    {
        "id": "l705knp",
        "author": "yungmoody",
        "created_utc": 1717465995.0,
        "score": 1,
        "parent_id": "t1_l703h9q",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l705knp/",
        "text": "The topic of discussion isn’t on how hard it is, it’s on the time it takes out of doing more creative/fulfilling activities."
    },
    {
        "id": "l734llu",
        "author": "colnross",
        "created_utc": 1717519257.0,
        "score": 1,
        "parent_id": "t1_l72rhsr",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l734llu/",
        "text": "I am a victim here"
    },
    {
        "id": "l71kfdv",
        "author": "Embarrassed_Ad_7184",
        "created_utc": 1717496087.0,
        "score": 2,
        "parent_id": "t1_l71d55x",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71kfdv/",
        "text": "Good point actually, I preface many of my comments and it's like I'm expecting immediate judgement for something unless I state where my opinion is comibf from... why do I even care that much??"
    },
    {
        "id": "l71dyn0",
        "author": "conbizzle",
        "created_utc": 1717491405.0,
        "score": 2,
        "parent_id": "t1_l71d55x",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71dyn0/",
        "text": "As a Caucasian African, I thank you for your response."
    },
    {
        "id": "l71dkhz",
        "author": "Dark_Knight2000",
        "created_utc": 1717491114.0,
        "score": 2,
        "parent_id": "t1_l6zz9ai",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71dkhz/",
        "text": "Honestly it’s absolutely hilarious to me that people are still complaining about how much effort laundry and dishwashing are when it’s fully automated already.\n\nAll you have to do is load the machines and they do it all for you. All you need is 5 minutes to load and unload each one and that’s too much.\n\nThere will never be a machine that does everything. Do you want it to literally take the plates from your hands and put it in the dishwasher?\n\nThe only way that’ll happen is with servants. These people want servants."
    },
    {
        "id": "l70kegt",
        "author": "5chrodingers_pussy",
        "created_utc": 1717472683.0,
        "score": 2,
        "parent_id": "t1_l70ii9i",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70kegt/",
        "text": "You bring up a couple somethings that are true, which i agree, but what is the point though of bringing them up? Like to the discussion? Not being inflammatory here, genuinely asking.\n\nAre you saying we’ve had enough convenience? That there’s a point at which we don’t deserve any more? That it’s wrong to advocate for comfort for the regular individual? When a select few can just keep buying yatchs to sit at ports, hogging up land to price gauge middle class, polluting air in private jets just to skip a 40 min car drive? \n\nHave you been convinced that any second of any free time you get should be spent for material gain? Do you feel or have been made to feel guilty by peers or family when you try enjoy your leisure? Some can’t even afford to have free time, as commuting, chores, multiple jobs can suck up your time. And then, seeing people post nudes online and racking in double or triple what you gain is validly off-putting. But if we let us be affected that much, we become susceptible to thinking that some things don’t qualify as “work”, when really there’s allways some amount of base effort required. This hate can seep in deep, and such stances are hurtful to you and peers in the long term. We should instead advocate that compensation for all be raised, instead of putting others down. \n\nA rising tide lifts all boats.\n\n\nWhat about those in need? A machine/utility accessible for me may not be so to someone in a wheelchair for example. Hell, even in medicine some procedures are outdated for women because studies and healthcare systems where built around men.\n\nThere’s never _not_ a time to improve **wellbeing**. Keypoint distinction wellbeing. AI can’t currently fit in that since AI ‘s real life consequences (as opposed to just the benefits and progress made in a vacuum that it entails) are overall harmful, even if they are just symptoms of a major problem with the workforce, labour rights and ideals."
    },
    {
        "id": "l70spm1",
        "author": "LeoGeo_2",
        "created_utc": 1717477170.0,
        "score": 0,
        "parent_id": "t1_l70qur3",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70spm1/",
        "text": "No, that's exactly what he's whining about. He's complaining that workload hasn't gone down, but that's not how things work. That technology has allowed the human population to balloon to the billions. And to keep those billions alive, you still need to do a lot of work."
    },
    {
        "id": "l6yo3ai",
        "author": "MoltenCamels",
        "created_utc": 1717445641.0,
        "score": 6,
        "parent_id": "t1_l6ymxn9",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yo3ai/",
        "text": "Yes of course. That's not my point at all."
    },
    {
        "id": "l6ynvc0",
        "author": "Bogdan_ch8",
        "created_utc": 1717445569.0,
        "score": 5,
        "parent_id": "t1_l6ykw9c",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ynvc0/",
        "text": "it will get physical at some point(we already have the vacuming robots)"
    },
    {
        "id": "l6ymxej",
        "author": "MoltenCamels",
        "created_utc": 1717445261.0,
        "score": 2,
        "parent_id": "t1_l6ykw9c",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ymxej/",
        "text": "Yes, I get that. That's not my point at all. My point is about how the original commenter thinks that doing these things are trivial and that all there is to it is to put things in a machine and push a button."
    },
    {
        "id": "l6yoktt",
        "author": "MoltenCamels",
        "created_utc": 1717445803.0,
        "score": 1,
        "parent_id": "t1_l6ynm58",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yoktt/",
        "text": "Plenty of people don't have dishwashers or washing machines, so it does take a lot of time out of their day. You gotta lug all your stuff to the laundromat or wash all your dishes.\n\nDid you even read what I wrote, or did you just get mad and continued typing?"
    },
    {
        "id": "l6zvugr",
        "author": "yungmoody",
        "created_utc": 1717461953.0,
        "score": -4,
        "parent_id": "t1_l6ynm58",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zvugr/",
        "text": "“Adult man who lives alone can’t possibly imagine why people who aren’t him spend more time doing chores” would make a great onion headline"
    },
    {
        "id": "l6yiw5l",
        "author": "gonzoes",
        "created_utc": 1717443938.0,
        "score": 3,
        "parent_id": "t1_l6yhcry",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yiw5l/",
        "text": "This is very true . The “most woke people” are always the ones who ask what does woke even mean. But it has changed meaning relatively fast . \n\nFirst it was used by mostly introspective black guys from what I remember when the word woke started emerging it was like the black guys who found the secrets to the universe. \n\nNow i think its some how morphed into just anyone who has really progressive thinking and very much people who dont want to hurt anyones feeling in anyway and all inclusiveness of all people.   Not really sure when the change exactly happened"
    },
    {
        "id": "l6zw54r",
        "author": "5chrodingers_pussy",
        "created_utc": 1717462073.0,
        "score": 0,
        "parent_id": "t1_l6yhcry",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zw54r/",
        "text": "If you let yourself be taken advantage by any party to manipulate you by using a just a loosely defined word, and you just agreeing because of a word with no further insight…\n\nYou are a pandering npc, sorry to break it to you."
    },
    {
        "id": "l6ymtcf",
        "author": "xtra_obscene",
        "created_utc": 1717445224.0,
        "score": -2,
        "parent_id": "t1_l6yhcry",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ymtcf/",
        "text": "How convenient"
    },
    {
        "id": "l6yjcpu",
        "author": "xtra_obscene",
        "created_utc": 1717444089.0,
        "score": 5,
        "parent_id": "t1_l6yiyci",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yjcpu/",
        "text": "So to the people using it, “woke” is just anything remotely left-leaning that right-wingers don’t like. Pretty much what I expected."
    },
    {
        "id": "l6z9s8z",
        "author": "whinger23422",
        "created_utc": 1717453230.0,
        "score": 0,
        "parent_id": "t1_l6yw79n",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z9s8z/",
        "text": "I mean that's fairly specific which is great... but based on that definition half the sh*t conservatives claim as \"woke\" doesn't fall into those terms.\n\nThat's why progressives concluded that \"woke\" is whatever conservatives don't like. That's the criticism."
    },
    {
        "id": "l6zhzmr",
        "author": "xtra_obscene",
        "created_utc": 1717456380.0,
        "score": 2,
        "parent_id": "t1_l6yws43",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zhzmr/",
        "text": "Why are you so upset?"
    },
    {
        "id": "l6zvqwl",
        "author": "5chrodingers_pussy",
        "created_utc": 1717461913.0,
        "score": 0,
        "parent_id": "t1_l6znv7b",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zvqwl/",
        "text": "So quick to get pissed"
    },
    {
        "id": "l718nux",
        "author": "5chrodingers_pussy",
        "created_utc": 1717487422.0,
        "score": 1,
        "parent_id": "t1_l717j15",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l718nux/",
        "text": "“There is a lot of mediocre art…” very anecdotal and bullshit. Commonplace from people who don’t realize they could do no better.\n\n“The sky is often green” is just as valid"
    },
    {
        "id": "l7189kd",
        "author": "5chrodingers_pussy",
        "created_utc": 1717487124.0,
        "score": 0,
        "parent_id": "t1_l717j15",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l7189kd/",
        "text": "It’s been proven the market doesn’t decide anymore. It’s a cheap hand-wavey phrase if anything. What decides are the kleptomaniacs and their goons.\n\nPeople have less buying power day by day. Less independence to strike and politically get involved against bad practices. Monopolies and buying out the competition and lobbying make it so there’s not much of a market to choose from and regulate at all. Manufacturers and transport orgs dump their waste where they please, or airlines shoot whistleblowers dead, or businesses are bailed out after gross mismanagement, all of this just to face a slap of the wrist and keep on playing their game. People don’t supprt this, but can’t shut it down etiher.\n\nNo, mr. Moneybags, monetary value is not an end-all indicator of something being overall good. Despite what silicon valley pays to have those misconceptions reach you as truth. Especially when it comes to art."
    },
    {
        "id": "l6ynd2t",
        "author": "HibbleDeBop",
        "created_utc": 1717445405.0,
        "score": 1,
        "parent_id": "t1_l6ykkxi",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ynd2t/",
        "text": "The direction of technology is such that fewer and fewer people are needed while more and more robots do the work. This trend will continue. I think it is fair to say that we are at a point where most production globally is done through machines, despite all but a very few factories needing atleast one person doing some complex task a machine cannot do yet."
    },
    {
        "id": "l6zuusz",
        "author": "5chrodingers_pussy",
        "created_utc": 1717461548.0,
        "score": 0,
        "parent_id": "t1_l6zqvis",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zuusz/",
        "text": "Oh you mean actual AI machine-humans with intelligence and independence, not the sales words of silicon valley for some very specific software?\n\nI mean, maybe, yeah those may do better art thab a human. But by then such an advanced being may just as well be considered human too. Or at least sentient. So moot point.\n\nTools of today replicate, and a replica can’t make better than what it copies, just the same or less. Faster and in bigger quantities yeah sure"
    },
    {
        "id": "l70wv4o",
        "author": "5chrodingers_pussy",
        "created_utc": 1717479642.0,
        "score": 1,
        "parent_id": "t1_l70uzie",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70wv4o/",
        "text": "Played out? I am right here, a human being with thoughts and loved ones, advocating for the same message. It’s a morally correct fight worth fighting. Real people are being affected by this issue. If we handle it correctly now it will save us trouble later with upcoming automation, not to mention adress issues of today yet unsolved.\n\nComing up with the frase or stealing it? So when the first frenchman said “liberte egalite fraternite” no one else was allowed to parrot the sentiment because it was not okay for some reason?\n\nIt’s not a meme, it’s a short and on point conversation opener. And even as a memes, memes can be “propaganda” or influence ideas or point at societal undercurrents."
    },
    {
        "id": "l6zzq8j",
        "author": "5chrodingers_pussy",
        "created_utc": 1717463565.0,
        "score": 1,
        "parent_id": "t1_l6zyq69",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zzq8j/",
        "text": "Ah my bad then, it’s hard to pick up nuance with just letters.\n\nYeah, there’ll be a time when machines can do almost everything. \n\nAnd if we don’t have to pay people to produce our stuff, then how will people have money to buy the stuff?\n\nIt’s farfetched now to think about, but if we look at the present we’re still delayed with dealing with old issues. There are children working at factories still. Billionaire buiseness being bailed out by taxpayer money, pocketing profit and placing the loss on the regular man. \n\nWe suck at stuff today, it’s not bad to start thinking about what to look out for tomorrow."
    },
    {
        "id": "l6zsdgm",
        "author": "5chrodingers_pussy",
        "created_utc": 1717460529.0,
        "score": 1,
        "parent_id": "t1_l6zs6qx",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zsdgm/",
        "text": "Very sure. Because that’s exactly what i admitted, that you _can_ do *more*. Just not *better*. Better meaning quality per piece.\n\nIm glad we agree, sorry i wasn’t clearer before"
    },
    {
        "id": "l70df6s",
        "author": "5chrodingers_pussy",
        "created_utc": 1717469362.0,
        "score": 1,
        "parent_id": "t1_l70d4zy",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70df6s/",
        "text": "Hey little guy, i paid for my english language so i’m gonna get my money’s worth.\n\nI know fancy words, i rack my brain. Try that from time to time, you may come up with a comment that actually means something. Put down the phone, pick up a thesaurus.\n\nThis is 100% organic, human, cognitive, locally-sourced banter coming atcha."
    },
    {
        "id": "l70x35o",
        "author": "5chrodingers_pussy",
        "created_utc": 1717479780.0,
        "score": 0,
        "parent_id": "t1_l70vc2o",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70x35o/",
        "text": "Funny, a lowly “video game enthusiast” can be approached to provide comments and insight for an entire article, yet you Mr. Big Man can’t type a full single sentence."
    },
    {
        "id": "l70x6cp",
        "author": "5chrodingers_pussy",
        "created_utc": 1717479835.0,
        "score": 1,
        "parent_id": "t1_l70wnbc",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70x6cp/",
        "text": "Thanks, valid. Would you still do art and writing if you were displaced from your job? What would you pivot to?"
    },
    {
        "id": "l6ylcou",
        "author": "SwindlingAccountant",
        "created_utc": 1717444744.0,
        "score": 2,
        "parent_id": "t1_l6yk3js",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ylcou/",
        "text": "Nuclear would be nice but I have good news for you:\n\n[Sweeping changes to America's aging power grid are on their way to help bypass NIMBY roadblocks and state infighting (msn.com)](https://www.msn.com/en-us/money/markets/sweeping-changes-to-americas-aging-power-grid-are-on-their-way-to-help-bypass-nimby-roadblocks-and-state-infighting/ar-BB1mUhYH?ocid=BingNewsSearch)\n\n[Federal-State Initiative Launched to Modernize U.S. Power Grid and Enhance Resilience | T&D World (tdworld.com)](https://www.tdworld.com/grid-innovations/transmission/article/55042942/federal-state-initiative-launched-to-modernize-us-power-grid-and-enhance-resilience)"
    },
    {
        "id": "l6zauq1",
        "author": "Shadowthron8",
        "created_utc": 1717453627.0,
        "score": 1,
        "parent_id": "t1_l6z9s0u",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zauq1/",
        "text": "I don’t remember but it was him and someone else talking about robots for Amazon or something"
    },
    {
        "id": "l6z0k7r",
        "author": "pangolin-fucker",
        "created_utc": 1717449876.0,
        "score": 9,
        "parent_id": "t1_l6yt7m2",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z0k7r/",
        "text": "This is it \n\nEnough"
    },
    {
        "id": "l6zq9mp",
        "author": "SageOfTheSixPacks",
        "created_utc": 1717459673.0,
        "score": 1,
        "parent_id": "t1_l6yq7bz",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zq9mp/",
        "text": "Did you just refer to your grandmother as your “gam gam” ?"
    },
    {
        "id": "l6yqlfs",
        "author": "TroobyDoor",
        "created_utc": 1717446486.0,
        "score": 0,
        "parent_id": "t1_l6yq7bz",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yqlfs/",
        "text": "Well that makes sense. 🤔 So does \"JANE GET ME OFF THIS CRAZY THING!!\""
    },
    {
        "id": "l707epr",
        "author": "spain-train",
        "created_utc": 1717466758.0,
        "score": 0,
        "parent_id": "t1_l6zk5y8",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l707epr/",
        "text": "There are literally machines in existence that fold laundry, and they've been around for a while. OP is right."
    },
    {
        "id": "l70qye6",
        "author": "LeoGeo_2",
        "created_utc": 1717476166.0,
        "score": 3,
        "parent_id": "t1_l70nlym",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70qye6/",
        "text": "No, genius, I'm discussing the past not even 200 years ago when we didn't have mass spread washing machines and showing how technology came and made doing the laundry 100X easier."
    },
    {
        "id": "l7eo4i6",
        "author": "Salty_Candy_3019",
        "created_utc": 1717697087.0,
        "score": 1,
        "parent_id": "t1_l7en3w3",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l7eo4i6/",
        "text": "You do realize that this just proves my point? The academic pursuit does not require screwing over artists or the general gentrification of culture! It's not the universities that are scraping your data every chance they get."
    },
    {
        "id": "l73cwlf",
        "author": "MagicalSenpai",
        "created_utc": 1717522035.0,
        "score": 1,
        "parent_id": "t1_l7371f1",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l73cwlf/",
        "text": "I was just quoting the guy I was replying to since it seemed he was being willfully ignorant.\n\nObviously the top of the field is only minimally effected so far. That being said saying no good artists are affected is crazy. AI are even being used in Superbowl commercials and league of Legends skins, unless you're saying that they would have used a bad artist if it wasn't available. \n\nCurrently talented direct to consumer artists are certainly affected the most (calling all of these artists bad is crazy). But that only because  companies get tons of backlash currently from using AI art. If companies could get away with using AI art they certainly would."
    },
    {
        "id": "l71biqc",
        "author": "DavantesWashedButt",
        "created_utc": 1717489576.0,
        "score": 2,
        "parent_id": "t1_l70ngo6",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71biqc/",
        "text": "Oh it for sure does.  Stacking pallets is bad for your body, having a robot take over those positions keeps people safer.  This goes for a ton of robots honestly.  Welding is a good example, the robots won’t fatigue and they don’t care about weld fumes or flash burn.  \n\nBut those robotic forklifts were the laughing stock of the plant.  Early tech, they’ve massively improved since I was around them but they ran off the Wi-Fi and factory Wi-Fi is always dogshit.  If one went down it broke their logic so it would halt the entire fleet.  40+ pallets stuck in the aisles.  And they put the only forklift operators they didn’t fire in charge of restarting them all.  Poor guys"
    },
    {
        "id": "l6zylfn",
        "author": "GenderJuicy",
        "created_utc": 1717463093.0,
        "score": 7,
        "parent_id": "t1_l6z7qyn",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zylfn/",
        "text": "The logic required to fold laundry isn't difficult, it's creating the robotics, manufacturing and distribution, scalability, etc is the difficult part. The fact that it's a real life act makes it a lot harder.\n\nIf there was a video game that simulated cloth that could fold like real life, AI could easily learn to fold it. It's just useless to do right now, unless you're training a robot to reenact that behavior in real life in the future.\n\nThat said, once we do have accessible robots, it will probably be one of the first things to automate. We already have a lot of companies working on that and displaying their results so far such as OpenAI, Tesla, and Google, and I imagine that will ramp up a lot faster than people expect."
    },
    {
        "id": "l6zil30",
        "author": "TruthWarm4750",
        "created_utc": 1717456615.0,
        "score": -5,
        "parent_id": "t1_l6z7qyn",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zil30/",
        "text": "Bruh what the fuck? As an artist this just ain't it. Making art should not be easy. You really think making a painting or sculpture or graphic design is easier than folding a shirt? I know your point was to the actual coding and creating through ai. I don't buy for a second creating a thing that surfs all of the Internet to make you an image instantly is easier to develop than a thing that folds clothes..."
    },
    {
        "id": "l6zh8l6",
        "author": "seeeeeeeeth",
        "created_utc": 1717456084.0,
        "score": -4,
        "parent_id": "t1_l6z7qyn",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zh8l6/",
        "text": "Which job pays more though? \n\nSomething purely mechanical has set parameters. And though some motions require complicated parameters, the boundaries are still fairly narrow. Imagine the complexity of an engine. WAY more complex than a laundry folding machine. We figured out the engine decades ago because that's where the money was. \n\nGenerative process is completely different. Its parameters are hard to even conceptualize and the boundaries can expand infinitely. Even though generative art is not great at this point, the fact that ai can do anything close to what it can do is a far greater leap than if it could fold laundry. Its the distance of the leap and how much it incites  imagination that brings in the money. \n\nCreating \"decent\" art is definitely not easier than folding laundry."
    },
    {
        "id": "l7097ci",
        "author": "seeeeeeeeth",
        "created_utc": 1717467521.0,
        "score": 1,
        "parent_id": "t1_l6zk7lf",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l7097ci/",
        "text": "This is kinda my point though... the reason we have advances in art generation is that it's expensive to pay humans to do that (aka there's money to be had in developing the tech for it).\n\nPart of the reason there's not as much money in automating basic time saving tasks is it's cheap labor, less demand (there's no money in it).\n\nUltimately, money is always the driver."
    },
    {
        "id": "l6ym4gv",
        "author": "robbodee",
        "created_utc": 1717444997.0,
        "score": 10,
        "parent_id": "t1_l6ykyih",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ym4gv/",
        "text": "Calm down with the exclamation points. Jesus."
    },
    {
        "id": "l6yqj7v",
        "author": "throwaway_12358134",
        "created_utc": 1717446465.0,
        "score": 3,
        "parent_id": "t1_l6ykyih",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yqj7v/",
        "text": "AI knows what we think is beautiful, and that is terrifying on its own."
    },
    {
        "id": "l6ymmbo",
        "author": "Bigassbagofnuts",
        "created_utc": 1717445160.0,
        "score": 4,
        "parent_id": "t1_l6ykyih",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ymmbo/",
        "text": "Your constant exclamation reveals your insanity."
    },
    {
        "id": "l6ynprh",
        "author": "JudoTrip",
        "created_utc": 1717445520.0,
        "score": 1,
        "parent_id": "t1_l6ykyih",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ynprh/",
        "text": ">Do robots feel or they repeat what a human feels ?\n\nNot right now, but there's nothing magical about feelings, so it's not beyond the realm of possibility that there could be machines that feel.\n\nFeelings are just chemical processes happening in your physical brain and nervous system.\n\n>Does a robot know what beauty is or do they just measure the symmetry and proclaim they are within a standard of beauty!\n\nBeauty is subjective.\n\nDon't humans do the same thing?  If you've ever designed something for someone else or for public consumption, you know that you sometimes have to sacrifice what you like for what the client/public will like, and to do this, you have to appeal to their sense of beauty/design.\n\n>If a machine fucks you does it love you ? Does she interact with your emotions or does it just scratch your lust receptors!\n\nIt sounds like you want to pretend that there is something mystical about the human experience.  There isn't. We are meat-machines in meat bodies with meat computers for brains.  \n\nA machine being made out of non-meat doesn't mean it can't do/think/feel as we do, given enough time."
    },
    {
        "id": "l6ynumj",
        "author": "DayDreamerJon",
        "created_utc": 1717445563.0,
        "score": 1,
        "parent_id": "t1_l6ym3oh",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ynumj/",
        "text": "thats a cute saying for somebody who doesnt understand what \"interact\" means. Robots with simple AI already interact with the world https://www.youtube.com/watch?v=RbyQcCT6890"
    },
    {
        "id": "l6z93x5",
        "author": "hiltojer000",
        "created_utc": 1717452974.0,
        "score": 0,
        "parent_id": "t1_l6yzc4q",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z93x5/",
        "text": "https://preview.redd.it/1ew7xpkglf4d1.jpeg?width=1170&format=pjpg&auto=webp&s=984f2af77ec80cbef0ed3d74596038650230a9a5"
    },
    {
        "id": "l6zj6yo",
        "author": "TruthWarm4750",
        "created_utc": 1717456850.0,
        "score": 4,
        "parent_id": "t1_l6ysm6d",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zj6yo/",
        "text": "Yeah no shit. Just like a calculator can do better math than most people....the calculator didn't create math"
    },
    {
        "id": "l755mxq",
        "author": "CliffBoof",
        "created_utc": 1717544497.0,
        "score": 1,
        "parent_id": "t1_l6z4grx",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l755mxq/",
        "text": "If it’s not intelligent what would you call it?"
    },
    {
        "id": "l70vono",
        "author": "ramxquake",
        "created_utc": 1717478921.0,
        "score": 5,
        "parent_id": "t1_l705knp",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70vono/",
        "text": "Five minutes putting clothes in and out of the washing machine to save hours of labour."
    },
    {
        "id": "l7069at",
        "author": "Klutzy_Ad_325",
        "created_utc": 1717466278.0,
        "score": 3,
        "parent_id": "t1_l705knp",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l7069at/",
        "text": "What would AI do to speed up these chores? I load and unload my own dishwasher and fold my own clothes. It is so easy. What would AI do exactly?"
    },
    {
        "id": "l723544",
        "author": "Latenighredditor",
        "created_utc": 1717505882.0,
        "score": 1,
        "parent_id": "t1_l71dyn0",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l723544/",
        "text": "Drake? \n\nDrake?\n\nAubrey from degrassi?"
    },
    {
        "id": "l71e1ti",
        "author": "gloriousjohnson",
        "created_utc": 1717491471.0,
        "score": 0,
        "parent_id": "t1_l71dkhz",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71e1ti/",
        "text": "I can tell you don’t have kids"
    },
    {
        "id": "l70qrmf",
        "author": "LeoGeo_2",
        "created_utc": 1717476061.0,
        "score": -1,
        "parent_id": "t1_l70kegt",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70qrmf/",
        "text": "No, I'm saying that we already have seen technology improve our lives and make things more convenient. Complaining that it hasn't fixed every problem in the world is kinda insane given how much and how quickly it's already done. \n\nI'm saying that you can't expect utopia in an instant. That you can't expect utopia at all. There is always a time to try to improve wellbeing, but the key word is TRY. There will be mistakes, there will be things that appear bad but have some benefit, and things that appear good, but have some drawback. AI is trying to improve things. Hell, it's been pretty useful for a lot of people too."
    },
    {
        "id": "l70v555",
        "author": "5chrodingers_pussy",
        "created_utc": 1717478596.0,
        "score": 2,
        "parent_id": "t1_l70spm1",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70v555/",
        "text": "Hmm no, missed it again. My bad, i’ll try be clearer.\n\nSo if we need a lot of work, why are machine and software alike putting many people out of business, and a select few who were already well off in a higher position?\n\nAre these CEOs making so much more work suddenly, that warrants all that profit? This profit they pocket, will it put it to good use, creating more jobs to drive the economy and sustain human expansion? \n\nEasy answer is no, because creating more jobs costs short term expense for not-guaranteed long term gain, while cutting them for the “cool new thing”tm makes short term big bucks.\n\nPeople get fired and funneled into ehatever jobs remain, creating unemployment. Remember “should’ve learnt coding”? Now that software jobs are looking to grt automated, suddenly you “should’ve learnt a trade”.\n\nLets imagine forwards a little. What happens when every job is automated? When nobody is _allowed_ to work and be paid? Who buys amazon? Who buys houses? Do we give up and resort to manual labour, growing our own food and building our own houses?\n\nWho pays the machines? Do machines pay taxes for all the overpopulation and ageing people that will add up to the cost of retirement on the working class?\n\nTalking about human expansion and demand, are you aware that we have the resources available to work towards ending world hunger, and leaders choose not to? Insulin is dirt cheap to make and yet it costs a whole lot more to buy. Airline companies are willing to hunt down whistleblowers because it’s cheaper than having the news spread and stocks drop. Can you believe this? That it’s “better” for “the economy” to have children in factories? And that you should abandon work from home? And work more hours? And if you are unwilling, you should be replaced? And that if you aren’t working you don’t deserve healthcare? \n\nAd infinitum, until lawmakers react, which doesn’t happen as they are lobby-bought. Until legislation is passed, except we are still legally defining what is social media, congress full of old farts. Well, until we strike to hurt profit? Oh, no more bargaining chips as you just get replaced? Or companies wait you out to run out of resources unlike them? Fuck do i have to put a guilliotine on a CEO’s doorstep to be heard?\n\n**What OP meant was any progress we make is misused for the benefit of these gold-hoarding dragons and the detriment of the regular human individual. So no, all things considered it’s not real progress**"
    },
    {
        "id": "l73l8ud",
        "author": "madhatter8989",
        "created_utc": 1717524849.0,
        "score": 1,
        "parent_id": "t1_l70spm1",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l73l8ud/",
        "text": "I'm not complaining. I'm explaining a fact of modern western economics. U.S. productivity has more than doubled in my lifetime thanks to advances in technology. Do you make twice the money your parents made for a similar job? Has the population doubled? Do you work half as many hours? The only thing that keeps up with productivity is profit and profit is not distributed proportionally."
    },
    {
        "id": "l6yot8a",
        "author": "sexyama",
        "created_utc": 1717445878.0,
        "score": -2,
        "parent_id": "t1_l6yo3ai",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yot8a/",
        "text": "that's true"
    },
    {
        "id": "l6yqaaa",
        "author": "Bogdan_ch8",
        "created_utc": 1717446378.0,
        "score": -3,
        "parent_id": "t1_l6yoktt",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yqaaa/",
        "text": "the same people wont afford ai powered robots so whats your point?"
    },
    {
        "id": "l719fhg",
        "author": "Bogdan_ch8",
        "created_utc": 1717487999.0,
        "score": 2,
        "parent_id": "t1_l6zvugr",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l719fhg/",
        "text": "im sure wining about it gets more views 😂"
    },
    {
        "id": "l6z8grr",
        "author": "Singularity-42",
        "created_utc": 1717452733.0,
        "score": 5,
        "parent_id": "t1_l6yiw5l",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z8grr/",
        "text": "It morphed into a pejorative. Nobody calls themselves 'woke' for at least a decade now."
    },
    {
        "id": "l6z3u2n",
        "author": "SheepD0g",
        "created_utc": 1717451046.0,
        "score": 5,
        "parent_id": "t1_l6yiw5l",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z3u2n/",
        "text": "Any \"progressive\" that calls themselves \"woke\" is a moron. The right are the only ones that actually use that word nowadays."
    },
    {
        "id": "l6ypovu",
        "author": "MKtheMaestro",
        "created_utc": 1717446174.0,
        "score": 1,
        "parent_id": "t1_l6yiw5l",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ypovu/",
        "text": "Absolutely correct. It’s argument number 1 for them. Everybody, if honest with themselves, knows that woke refers to phony activism. The initial meaning of woke came from the black community and referred to individuals who are more in tune with how various systems function to oppress. Over time, as SJWs became a thing, it became almost a derogatory term to refer to people who criticize and judge others for their treatment of minority groups they are not a part of and for people who proclaim to support various causes they know little about."
    },
    {
        "id": "l6zalnt",
        "author": "JonathanSD7",
        "created_utc": 1717453531.0,
        "score": 1,
        "parent_id": "t1_l6yiw5l",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zalnt/",
        "text": "But that being woke is actually exclusionary to any thought opposed to woke. Wokists are the opposite of who they believe themselves to be"
    },
    {
        "id": "l6zwq0v",
        "author": "cure4boneitis",
        "created_utc": 1717462313.0,
        "score": 2,
        "parent_id": "t1_l6zw54r",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zwq0v/",
        "text": "I’m never woke.  Even during the day I be shutting my eyes"
    },
    {
        "id": "l6yu2r4",
        "author": "mvstateU",
        "created_utc": 1717447652.0,
        "score": 3,
        "parent_id": "t1_l6yjcpu",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yu2r4/",
        "text": "The truth is right-wingers are using \"woke\" a million times more than the left is.    It's like the usage of the word lib/libs  or hunter biden's laptop."
    },
    {
        "id": "l6ywzfh",
        "author": "wiggityp",
        "created_utc": 1717448628.0,
        "score": 0,
        "parent_id": "t1_l6yjcpu",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6ywzfh/",
        "text": "You sound like a real fun hang."
    },
    {
        "id": "l6yjpim",
        "author": "Financial_Exit7547",
        "created_utc": 1717444206.0,
        "score": -7,
        "parent_id": "t1_l6yjcpu",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yjpim/",
        "text": "Did you eat the comprehension lesson out of your homeschooling coloring book?"
    },
    {
        "id": "l74nkuc",
        "author": "juan_rico_3",
        "created_utc": 1717537646.0,
        "score": 1,
        "parent_id": "t1_l718nux",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l74nkuc/",
        "text": "Let's take a specific example, like a typical police procedural TV show such as Law and Order. Act by act, it's basically a formulaic mad lib script that varies little in substance from episode to episode. I fully expect AI to be able to write similar scripts soon if it can't already. \n\nAs I said, as long as humans can make professional art that better meets the needs of the market, they will have jobs making art, but once AI can meet market needs better/faster/cheaper, that job is over. AI is already writing routine news stories, is capable writing classical music, makes graphic art that far exceeds the ability of untrained humans, etc.\n\nAs for the intellectual property problem, Adobe addressed that problem with their Firefly product. Firefly is trained on licensed content only so their users are on safe ground. The other AI models, e.g. ChatGPT, do have some legal risk around this. It will be interesting to see how that plays out."
    },
    {
        "id": "l74qp3r",
        "author": "juan_rico_3",
        "created_utc": 1717538773.0,
        "score": 2,
        "parent_id": "t1_l7189kd",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l74qp3r/",
        "text": "Hey, if you can make awesome art and convince people to buy it, more power to you. There are more opportunities than ever to do that with fewer gatekeepers than in the past. Music, video, self-published books, take your pick. \n\nOr, if you don't want to measure art's value by its monetary value, which is totally reasonable, we all have access to more tools than ever to make art and share it free of charge. \n\nThe creative professions are now facing the same challenges that the blue collar manufacturing workers and agrarian workers faced decades ago. The labor force adjusted and prosperity increased. I have no interest to going back to 1870 when over half the labor force was in farming. I think that increased mechanization was an improvement. \n\nI took a quick look at the OP's Amazon author profile. She writes a lot of sequel-driven fantasy genre books. I haven't read her books, but if they are pretty formulaic, then they will be vulnerable to being out-competed by AI content. A shame for her, but a boon for the consumer, who will get to exercise preference. \n\n[https://www.amazon.com/stores/author/B089B65VHB/about](https://www.amazon.com/stores/author/B089B65VHB/about)"
    },
    {
        "id": "l6yozc8",
        "author": "ocudr",
        "created_utc": 1717445935.0,
        "score": 1,
        "parent_id": "t1_l6ynd2t",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yozc8/",
        "text": ">I think it is fair to say that we are at a point where most production globally is done through machines,\n\nYeah this is not fair to say at all, though. It's just not based in reality. I agree that we might get there one day but we are not there yet."
    },
    {
        "id": "l70doma",
        "author": "International_Cup588",
        "created_utc": 1717469481.0,
        "score": 0,
        "parent_id": "t1_l70df6s",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70doma/",
        "text": "Hey there, wordsmith! Nice flex with the vocab, but don't strain yourself too hard. While you’re busy racking your brain, just remember: whether it's AI or human, it’s all about the content. If you need help coming up with something meaningful, feel free to ask—I'm always here to help, 100% organically and cognitively, of course!"
    },
    {
        "id": "l70x9sy",
        "author": "jsideris",
        "created_utc": 1717479894.0,
        "score": 1,
        "parent_id": "t1_l70x6cp",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70x9sy/",
        "text": "I don't do art and writing for work. I do it for fun. AI helps. If I got displaced from my job I'd find a new job."
    },
    {
        "id": "l71iy6f",
        "author": "commander_hugo",
        "created_utc": 1717495088.0,
        "score": 6,
        "parent_id": "t1_l6z0k7r",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71iy6f/",
        "text": "You know you've reached the end of Reddit when pangolin-fucker says they've had enough."
    },
    {
        "id": "l6zrsrv",
        "author": "usmcBrad93",
        "created_utc": 1717460296.0,
        "score": 2,
        "parent_id": "t1_l6zq9mp",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zrsrv/",
        "text": "Nah, that's just what I perceive to be the funnier version of Grandma.\n\nEx. My character name on Diablo 4 is GamGamGumJob"
    },
    {
        "id": "l70c4qi",
        "author": "PromiseOk3321",
        "created_utc": 1717468790.0,
        "score": 6,
        "parent_id": "t1_l707epr",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70c4qi/",
        "text": "Ofc! It just hasn't proved scalable yet"
    },
    {
        "id": "l73f9zs",
        "author": "Singularity-42",
        "created_utc": 1717522836.0,
        "score": 1,
        "parent_id": "t1_l73cwlf",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l73f9zs/",
        "text": "Well, my only issue was with the word \"anyone\". It is affecting *some*, but not all."
    },
    {
        "id": "l6zz7aw",
        "author": "mikew_reddit",
        "created_utc": 1717463348.0,
        "score": 4,
        "parent_id": "t1_l6zylfn",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zz7aw/",
        "text": "> The logic required to fold laundry isn't difficult,\n\nIt looks easy but it's incrediblt difficult.\n\nThere's many examples of robots trying to do mundane physical tasks that humans do easily and failing miserably.\n\n&nbsp;\n\nHere's a video of a company that got $89M in funding on  a clothes folding machine that cost $16,500 and took 5 to 10 minutes but often couldn't fold clothes outside the demo. It went bankrupt after 4 years: [14 Tech Fails (Episode 13) - YouTube](https://www.youtube.com/watch?v=Ay9RL5YQViA&t=1m42s). If it can't be done with $89M and 4 years, it's not easy."
    },
    {
        "id": "l6zmv47",
        "author": "2016",
        "created_utc": 1717458300.0,
        "score": 11,
        "parent_id": "t1_l6zil30",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zmv47/",
        "text": "Bruh wtf? Turns out painting is easier than folding a shirt, sorry."
    },
    {
        "id": "l6zp0gm",
        "author": "Danne_H",
        "created_utc": 1717459165.0,
        "score": 5,
        "parent_id": "t1_l6zil30",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zp0gm/",
        "text": "Well it is. \n\nYou can probably make something that folds clothes. But no one's paying good money for a machine that simply automates one part of the process. It's too narrow of a use case. You'd want it to be able to go through the whole process, from gathering your clothes, to washing, drying, ironing and folding. Now suddenly you need a machine capable of efficiently maneuvering through a physical environment, interacting with other electronics and with fine motor skills. That's also practical, affordable and durable. \n\nYeah that's a lot harder than creating a program that simply does all its work in a virtual space, hooked up to and derived from the stored collective creations of most of humanity. \n\nWhich is why graphical designers are starting to be let go. While carpenters, electricians and plumbers are sitting pretty."
    },
    {
        "id": "l6zpjze",
        "author": "Danne_H",
        "created_utc": 1717459384.0,
        "score": 5,
        "parent_id": "t1_l6zil30",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zpjze/",
        "text": "Basically. \n\nFor humans, creating good art is a lot harder than folding shirts. \n\nFor humans, creating technology that takes care of your chores is a lot harder than creating technology that creates good art."
    },
    {
        "id": "l6zz8rl",
        "author": "echief",
        "created_utc": 1717463365.0,
        "score": 0,
        "parent_id": "t1_l6zil30",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zz8rl/",
        "text": "Making a machine that folds shirts is easy. It’s just one automated part of a human controlled process. Just like a washer drier does the steps people used to do by hand. Washing each piece of clothing individually, hang drying them. We made some machines to do that for us. This does not require AI. \n\nA human loads the washing machine, sets their preferred settings, separates colors from whites. Moves the clothes from the washer to the drier. Sets the settings again. Takes the clothes out and FOLDS THEM. This is in all caps is the single step you are describing. It is one automated part in a human led chain.\n\nThen the human maybe irons a few shirts, and sorts them into a a closet and dresser in a desired way. None of this requires AI because a human is manually controlling the entire process. Creating a human like automaton that thinks for itself and does every single step along the way in this process is not easy. \n\nI can prove it to you very simply. If it was easy to build an AI controlled robot that made decisions through all of these laundry steps, it would only be a bit more complicated to build an AI machine that can fight and kill human soldiers without direct human input.\n\nEvery major military on earth would be fighting wars with automatons that can think for themselves, react the way that humans do. Hell, even just walk through a desert without falling down. We currently cannot. That is why we use human controlled machines like drones instead. For the same reason we use washing machines, not robot slaves that run through all the steps for us. For the same reason humans are still required to drive their own cars instead of an AI controlling everything while you sit back and relax.\n\nThe amount of demand for an automaton like this is thousands of times more than valuable than an AI that spits out company logos or posters that look nice. It is easier for AI to figure out, that is a fact. We know this because one exists and the other doesn’t. Creating images or coherent pieces of writing is even easier than building a robot complex enough to consistently “walk around” like a human. One that can navigate its environment without bumping into things, run at high speeds, easily and immediately follow commands.\n\nIt is easier than creating a robot dog that could be used in warfare. Otherwise we would just be letting machine gun mounted AI dogs that respond to commands like a real dog out on the battlefield to fight for us"
    },
    {
        "id": "l6zkqhw",
        "author": "MikeAWBD",
        "created_utc": 1717457457.0,
        "score": 7,
        "parent_id": "t1_l6zh8l6",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6zkqhw/",
        "text": "The fact that you think an engine is way more complicated than a laundry robot says it all. You have very little understanding of programming, engineering and mechanics."
    },
    {
        "id": "l70ks1w",
        "author": "Singularity-42",
        "created_utc": 1717472872.0,
        "score": 2,
        "parent_id": "t1_l6zh8l6",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70ks1w/",
        "text": "Folding laundry is waaay harder than assembling predictable engine or generating passable art. Plumbing would be even a lot harder than the laundry.\n\nBut it's coming"
    },
    {
        "id": "l70mqfa",
        "author": "dontshootthattank",
        "created_utc": 1717473872.0,
        "score": 1,
        "parent_id": "t1_l7097ci",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70mqfa/",
        "text": "if you could get a robot that folds laundry for example, that could probably be applied to robot housekeepers, and more generally if manual tasks are automated so many things like painting and fast food workers, eventually everything I guess. There would be a lot of interest from companies."
    },
    {
        "id": "l71immh",
        "author": "acoolghost",
        "created_utc": 1717494868.0,
        "score": 1,
        "parent_id": "t1_l6ymmbo",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l71immh/",
        "text": "Big \"screaming at people on the sidewalk\" energy here."
    },
    {
        "id": "l6yocs4",
        "author": "Sardoodledome",
        "created_utc": 1717445728.0,
        "score": -7,
        "parent_id": "t1_l6ynprh",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yocs4/",
        "text": "Your view of the world is so simple that you believe a monkey fucked a lizard your granmother came out! I believe there is more to life than a meat! Did you know that if I put you in a room without music and you hear no music for more than 30 days you will go crazy?! How does this fit into your meat machine that should not care about the lack of music. Not sound just music...."
    },
    {
        "id": "l6yp3x7",
        "author": "Sardoodledome",
        "created_utc": 1717445977.0,
        "score": 2,
        "parent_id": "t1_l6ynumj",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6yp3x7/",
        "text": "A machine is made to interact a human wills to interact! Do you see a difference ?! And wow a machine did 1 thing that a 3 year old can do. But the 3 year old has free will and desire to do much more things, while the machine is forced to ! If I force you to play football do you interact or do you do what I told you to do !"
    },
    {
        "id": "l6z9rge",
        "author": "Sardoodledome",
        "created_utc": 1717453221.0,
        "score": 1,
        "parent_id": "t1_l6z93x5",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l6z9rge/",
        "text": "Look up - The troley problem and you will understand why there will never be single alone AI without humans as hosts or network!"
    },
    {
        "id": "l75ris8",
        "author": "tuskdust",
        "created_utc": 1717553469.0,
        "score": 1,
        "parent_id": "t1_l755mxq",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l75ris8/",
        "text": "I dunno, imitation programs."
    },
    {
        "id": "l70834h",
        "author": "TheUnforgivenII",
        "created_utc": 1717467046.0,
        "score": 1,
        "parent_id": "t1_l7069at",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70834h/",
        "text": "Dont think too hard now!"
    },
    {
        "id": "l70rx7k",
        "author": "5chrodingers_pussy",
        "created_utc": 1717476717.0,
        "score": 2,
        "parent_id": "t1_l70qrmf",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70rx7k/",
        "text": "Hmm i was with you until that last segment. Yes idealism is miserable, but needed. Reconcile that we’ll never get utopia, yet still we should walk towards it getting as close as possible without backtracking. Now:\n\nAi in paper does improve things and sound cool. The real case scenario, the context and consequences, is that legislation is not ready to regulate, lawmakers are years behind when it comes to technology, and corporations practice rampant theft and do palpable harm. Whatever benefits its bringing it doesn’t outweigh that harm. Unless of course one is of the select few who are in a position to reap rewards from displacing or stealing other people’s work. Or in a position to enjoy it because the ripples haven’t reached you yet. Or more so, have the resources to withstand that hit when it’s knocking at your door.\n\nI don’t care that orgs new and old are making money, it’s not an indicator of true success from an ethical perspective. The AI train needs slowing down until we get our shit together or it’s gonna cause big problems sooner than we are ready to tackle."
    },
    {
        "id": "l70zyfn",
        "author": "LeoGeo_2",
        "created_utc": 1717481591.0,
        "score": 1,
        "parent_id": "t1_l70v555",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l70zyfn/",
        "text": "You can't have it both ways. Is the workload still high, or is it going so low that there aren't anymore jobs? Pick one."
    },
    {
        "id": "l73ll98",
        "author": "LeoGeo_2",
        "created_utc": 1717524967.0,
        "score": 1,
        "parent_id": "t1_l73l8ud",
        "subreddit": "JoeRogan",
        "permalink": "/r/JoeRogan/comments/1d7cpts/what_do_you_guys_think_about_this/l73ll98/",
        "text": ">The only thing that keeps up with productivity is profit and profit is not distributed proportionally.\n\nAnd tech that makes life easier, don't forget that.\n\nMy parents didn't have phones with gps, for instance."
    }
]